'use strict'

Задача №1
Що потрапить в консоль?

let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}

Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.


Задача №3
Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}

Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку 

Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль

// ВІДПОВІДІ
//Задача №1
У консоль потрапить 1, тому що спрацював інкремент у префіксному


// Задача №2
for (let i = 1; i <= 10; i++) {
	console.log(`Пункт №${i}`)
}
Умова циклу починається з 1 тому що в завданні написано, що відлік має починатися з 1.
Далі при кожній ітерації у консоль виводиться число відповідно до кількості ітерацій, 
а 10-й пункт виводиться тому що відбулося присвоєння

// Задача №3
// Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}
Перша умова, 2 * 20 <= 10, не виконується, оскільки 40 <= 10, отже false.
Друга умова 30 / 2 < 5 && 10 <= "10", тобто 15 < 5 && 10 <= "10" а це означає false.
Третя умова 20 === "20" це суворе порівняння, отже false.

Отже:
false || false || false
у консоль нічого не потрапить


//  Задача №4

function divide(a, b) {
  // Перевіряємо, чи були передані аргументи
  if (a === undefined || b === undefined) {
    return "Немає аргументів";
  }

  // Перетворюємо аргументи на числа
  a = Number(a);
  b = Number(b);

  // Якщо ділитель дорівнює нулю, повертаємо помилку
  if (b === 0) {
    return "Ділитель не може бути рівним нулю";
  }

  // Повертаємо результат ділення
  return "Результат ділення: " + a / b;
	
}
console.log(divide(100, 2));

// Задача №5
let someArray = [true, 'laptop', 'monitor', 10, 'keyboard']

someArray.forEach((value, index) => {
	if(value == 10) {
		console.log(value)
	}
})